app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def show
    @user = User.find(params[:id])

INSERT INTO "users" ("updated_at", "salt", "name", "email", "created_at", "encrypted_password") VALUES ('2011-07-13 21:59:14.928687', 'b4e9ba7a2e23c58c8b0d75c12ab99d09df2a5de0ac064f45d5c4abf4e7329eee', 'ben', 'ben@test4.com', '2011-07-13 21:59:14.928687', '378717a6097b463fcbcf7507885b0a8a644aa497c9d22c2256784fd633506259')
---
 def create
    @user = User.new(params[:user])
    if @user.save